Revit 2024 API
ViewOrientation3D.EyePosition Property
 The eye position point
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ EyePosition { get; }
Visual Basic
Public ReadOnly Property EyePosition As XYZ
	Get
Visual C++
public:
property XYZ^ EyePosition {
	XYZ^ get ();
}
See Also
ViewOrientation3D Class
Autodesk.Revit.DB Namespace